app/views/comments/_comments.html.erb

SELECT `comments`.* FROM `comments` WHERE (`comments`.video_id = 1)
---

<%@video.comments.each do |c|%>