app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT `comments`.* FROM `comments`

  def show
    @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE (`comments`.`id` = 1) LIMIT 1

  def create
    @comment = Comment.new(params[:comment])
    video = Video.find(params[:video_id])
    @comment.video = video

    respond_to do |format|
      if @comment.save
---
SELECT `videos`.* FROM `videos` WHERE (`videos`.`id` = 1) LIMIT 1
INSERT INTO `comments` (`video_id`, `user_id`, `timestamp`, `comment`, `created_at`, `updated_at`) VALUES (1, NULL, '1234', 'adfasdfasdf', '2010-12-06 05:14:24', '2010-12-06 05:14:24')

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE (`comments`.`id` = 1) LIMIT 1
DELETE FROM `comments` WHERE (`comments`.`id` = 1)