app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`email`, `pass`, `name`, `last_name`, `crypted_password`, `password_salt`, `persistence_token`, `single_access_token`, `last_login_ip`, `created_at`, `updated_at`) VALUES ('fabian.bravo.gato@gmail.com', NULL, 'Fabian', 'Bravo', 'e523f680747f7eb35570e9f117d333316fa4f8c188b2edcbf6f9af75dd56c2f71f99713bfe6b404f48822f6e06e239ae86e4b1e1fe4e996f897a0f940cce502a', '-YfOsAbdJeTIzVb6BYmi', '3283aab5e155d0657146fe1233bf7b13c04f0d9e2c883aecac0803bdc525f63aea46aee838ff2d65f528e7bb13671d55c7e9205e001a3d0e0d564103e7c32bce', 'jIwyKN0OgL3EFv8mIdxz', NULL, '2010-12-06 04:42:54', '2010-12-06 04:42:54')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save