app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT `videos`.* FROM `videos`

  def show
    @video = Video.find(params[:id])
    @user = User.find_by_id(1) #current_user
    @comment = Comment.new
    @comment.user = User.find(1) #current_user <----- importante cambiar una vez instalado el sistema de usuarios
---
SELECT `videos`.* FROM `videos` WHERE (`videos`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.video_id = 1)

  def edit
    @video = Video.find(params[:id])
---
SELECT `videos`.* FROM `videos` WHERE (`videos`.`id` = 1) LIMIT 1

  def create
    @video = Video.new(params[:video])

    respond_to do |format|
      if @video.save
---
INSERT INTO `videos` (`yt_id`, `user_id`, `name`, `course`, `professor`, `semester`, `crypted_password`, `password_salt`, `persistence_token`, `single_access_token`, `last_login_ip`, `created_at`, `updated_at`) VALUES ('4gcrIegyDX0', 1, 'Clase 3', 'Comunicacion de Patos', 'Jo', '2010-2', NULL, NULL, NULL, NULL, NULL, '2010-12-06 04:59:54', '2010-12-06 04:59:54')

  def update
    @video = Video.find(params[:id])

    respond_to do |format|
      if @video.update_attributes(params[:video])
---
SELECT `videos`.* FROM `videos` WHERE (`videos`.`id` = 1) LIMIT 1
UPDATE `videos` SET `semester` = 'gWl5MgXTzwg', `updated_at` = '2010-12-05 07:06:24' WHERE (`videos`.`id` = 1)